# Pandas - DataFrame and series 
- data manipulation capabilities
- data cleaning 
- series(one-dimensional) and Dataframe(two-dimensional)

In [1]:
import pandas as pd

data=[1,2,3,4,5]
series=pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [2]:
# create a series from dictionary elements
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [3]:
data=[10,20,40]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    40
dtype: int64

In [4]:
## dataframe
## create a dataframe from a dictionary of list
data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [5]:
## create a dataframe from a list of dictionaries 
data = [
    {'Name': 'Krish', 'Age': 32, 'City': 'Bangalore'},
    {'Name': 'Aarav', 'Age': 28, 'City': 'Mumbai'},
    {'Name': 'Neha', 'Age': 24, 'City': 'Delhi'},
    {'Name': 'Rohan', 'Age': 35, 'City': 'Hyderabad'},
    {'Name': 'Meera', 'Age': 29, 'City': 'Chennai'},
    {'Name': 'Vikram', 'Age': 40, 'City': 'Pune'},
    {'Name': 'Sonia', 'Age': 31, 'City': 'Kolkata'},
    {'Name': 'Arjun', 'Age': 27, 'City': 'Ahmedabad'},
    {'Name': 'Priya', 'Age': 30, 'City': 'Jaipur'},
    {'Name': 'Rahul', 'Age': 33, 'City': 'Surat'},
    {'Name': 'Kavita', 'Age': 26, 'City': 'Lucknow'},
    {'Name': 'Manish', 'Age': 36, 'City': 'Nagpur'},
    {'Name': 'Anjali', 'Age': 25, 'City': 'Patna'},
    {'Name': 'Harish', 'Age': 38, 'City': 'Indore'},
    {'Name': 'Nisha', 'Age': 22, 'City': 'Bhopal'},
    {'Name': 'Vivek', 'Age': 34, 'City': 'Ludhiana'},
    {'Name': 'Pooja', 'Age': 23, 'City': 'Agra'},
    {'Name': 'Ajay', 'Age': 37, 'City': 'Varanasi'},
    {'Name': 'Divya', 'Age': 28, 'City': 'Nashik'},
    {'Name': 'Ravi', 'Age': 39, 'City': 'Amritsar'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0    Krish   32  Bangalore
1    Aarav   28     Mumbai
2     Neha   24      Delhi
3    Rohan   35  Hyderabad
4    Meera   29    Chennai
5   Vikram   40       Pune
6    Sonia   31    Kolkata
7    Arjun   27  Ahmedabad
8    Priya   30     Jaipur
9    Rahul   33      Surat
10  Kavita   26    Lucknow
11  Manish   36     Nagpur
12  Anjali   25      Patna
13  Harish   38     Indore
14   Nisha   22     Bhopal
15   Vivek   34   Ludhiana
16   Pooja   23       Agra
17    Ajay   37   Varanasi
18   Divya   28     Nashik
19    Ravi   39   Amritsar
<class 'pandas.core.frame.DataFrame'>

In [6]:
df=pd.read_csv('test_dir/sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [7]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [8]:
## accessing data from dataframe 
print(df['Date'])
type(df['Date'])

0      2024-01-01
1      2024-01-02
2      2024-01-03
3      2024-01-04
4      2024-01-05
          ...
235    2024-08-23
236    2024-08-24
237    2024-08-25
238    2024-08-26
239    2024-08-27
Name: Date, Length: 240, dtype: object

pandas.core.series.Series

In [9]:
# loc - pass the row index and column names  
df.loc[0:3,['Date','Region']]

         Date         Region
0  2024-01-01  North America
1  2024-01-02         Europe
2  2024-01-03           Asia
3  2024-01-04  North America

In [10]:
# iloc - pass the index only 
df.iloc[:,[1,7]]

           Date         Region
0    2024-01-01  North America
1    2024-01-02         Europe
2    2024-01-03           Asia
3    2024-01-04  North America
4    2024-01-05         Europe
..          ...            ...
235  2024-08-23         Europe
236  2024-08-24           Asia
237  2024-08-25  North America
238  2024-08-26         Europe
239  2024-08-27           Asia

[240 rows x 2 columns]

In [11]:
## Accessing a specified element 
# 
# 
df.at[2,'Region']

'Asia'

In [12]:
## Accessing a specified element using iat 
df.iat[2,2]

'Clothing'

In [13]:
## datamanipulation with dataframes 
df['Total_Revenue_All']=df['Unit Price']*df['Units Sold']

In [14]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method,Total_Revenue_All
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card,1999.98
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal,499.99
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card,209.97
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card,63.96
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal,89.99
...,...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal,159.99
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card,270.00
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card,32.97
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal,55.00
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card,59.98

In [15]:
## remove a column 
df.drop('Total_Revenue_All',axis=1,inplace=True)

In [16]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [17]:
df['Units Sold']=df['Units Sold']+1
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,3,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,2,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,4,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,5,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,2,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,2,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,4,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,4,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,2,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,3,29.99,59.98,Asia,Credit Card

In [18]:
## remove a row
df.drop(239,inplace=True)

In [19]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,3,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,2,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,4,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,5,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,2,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
234,10235,2024-08-22,Electronics,Bose QuietComfort 35 II Wireless Headphones,2,299.00,299.00,North America,Credit Card
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,2,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,4,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,4,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,2,55.00,55.00,Europe,PayPal

In [20]:
# displat the data types of each column 
print(df.dtypes)

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [21]:
print(df.describe())

       Transaction ID  Units Sold   Unit Price  Total Revenue
count      239.000000  239.000000   239.000000     239.000000
mean     10120.000000    3.158996   237.259205     336.853013
std         69.137544    1.325189   430.139050     486.494450
min      10001.000000    2.000000     6.500000       6.500000
25%      10060.500000    2.000000    29.500000      64.455000
50%      10120.000000    3.000000    89.990000     179.970000
75%      10179.500000    4.000000   249.990000     399.450000
max      10239.000000   11.000000  3899.990000    3899.990000

In [22]:
print(df.groupby('Product Category')['Units Sold'].mean())
print(df.groupby('Product Category')['Total Revenue'].mean())

Product Category
Beauty Products    2.150000
Books              3.850000
Clothing           4.625000
Electronics        2.650000
Home Appliances    2.475000
Sports             3.205128
Name: Units Sold, dtype: float64
Product Category
Beauty Products     65.547500
Books               46.548250
Clothing           203.223250
Electronics        874.560250
Home Appliances    466.154000
Sports             365.808718
Name: Total Revenue, dtype: float64

# Data Manipulation and analysis with Pandas

In [23]:
import pandas as pd


data=pd.read_csv('test_dir/data.csv')
data.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [24]:
data.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [25]:
data.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [26]:
## Handling missing values
data.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [27]:
data.isnull().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17     True
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28     True
29    False
30    False
31    False
32    False
33     True
34    False
35     True
36    False
37     True
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
dtype: bool

In [28]:
# filling missing values 
df_filled=data.fillna(0)

In [29]:
# filling missing values with mean of the values 
data['Sales'].fillna(data['Sales'].mean(),inplace=True)
data['Value'].fillna({'Value': data['Value'].mean()},inplace=True)

C:\Users\26amr\AppData\Local\Temp\ipykernel_5976\3093019536.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Sales'].fillna(data['Sales'].mean(),inplace=True)
C:\Users\26amr\AppData\Local\Temp\ipykernel_5976\3093019536.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Value'].fillna({'Value': data['Value'].mean()},inplace=True)

In [30]:
data.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       0
Region      0
dtype: int64

In [31]:
# renaming a column
data.rename(columns={'Date':'Sale_Date'},inplace=True)
#print(data.head())

#renaming multiple columns
multiple_columnname_change={
    'Date':'Sale_Date',
    'Category':'Item_Category',
    'Product':'Item_Product',
    'Region':'Sale_Region'
}
data.rename(columns=multiple_columnname_change,inplace=True)
print(data.head())

    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region
0  2023-01-01             A   28.0     Product1  754.0        East
1  2023-01-02             B   39.0     Product3  110.0       North
2  2023-01-03             C   32.0     Product2  398.0        East
3  2023-01-04             B    8.0     Product1  522.0        East
4  2023-01-05             B   26.0     Product3  869.0       North

In [32]:
# change the datatypes
data.head()
data['Sales_int']=data['Sales'].astype(int)
print(data.head())

    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region  Sales_int
0  2023-01-01             A   28.0     Product1  754.0        East        754
1  2023-01-02             B   39.0     Product3  110.0       North        110
2  2023-01-03             C   32.0     Product2  398.0        East        398
3  2023-01-04             B    8.0     Product1  522.0        East        522
4  2023-01-05             B   26.0     Product3  869.0       North        869

In [33]:
data['Sales_int']=data['Sales_int']+data['Sales_int']*0.1
print(data.head())

##using lambda function 
data['Sales_int']=data['Sales_int'].apply(lambda x:x+x*0.1)
print(data.head())

    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region  Sales_int
0  2023-01-01             A   28.0     Product1  754.0        East      829.4
1  2023-01-02             B   39.0     Product3  110.0       North      121.0
2  2023-01-03             C   32.0     Product2  398.0        East      437.8
3  2023-01-04             B    8.0     Product1  522.0        East      574.2
4  2023-01-05             B   26.0     Product3  869.0       North      955.9
    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region  Sales_int
0  2023-01-01             A   28.0     Product1  754.0        East     912.34
1  2023-01-02             B   39.0     Product3  110.0       North     133.10
2  2023-01-03             C   32.0     Product2  398.0        East     481.58
3  2023-01-04             B    8.0     Product1  522.0        East     631.62
4  2023-01-05             B   26.0     Product3  869.0       North    1051.49

In [34]:
# data Aggregating and grouping 
print(data.head())
groupby_mean=data.groupby('Item_Product')['Sales'].mean()
print(groupby_mean)

groupby_sum=data.groupby('Item_Product')['Sales'].sum()
print(groupby_sum)

    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region  Sales_int
0  2023-01-01             A   28.0     Product1  754.0        East     912.34
1  2023-01-02             B   39.0     Product3  110.0       North     133.10
2  2023-01-03             C   32.0     Product2  398.0        East     481.58
3  2023-01-04             B    8.0     Product1  522.0        East     631.62
4  2023-01-05             B   26.0     Product3  869.0       North    1051.49
Item_Product
Product1    573.758152
Product2    565.884058
Product3    536.217391
Name: Sales, dtype: float64
Item_Product
Product1     9180.130435
Product2     8488.260870
Product3    10188.130435
Name: Sales, dtype: float64

In [35]:
## group by 2 categorical variables 
groupby_Category_Product=data.groupby(['Item_Category','Item_Product'])['Value'].mean()
print(groupby_Category_Product)

Item_Category  Item_Product
A              Product1        46.800000
               Product2        28.200000
               Product3        75.500000
B              Product1         9.000000
               Product2        73.000000
               Product3        51.857143
C              Product1        75.400000
               Product2        61.714286
               Product3        46.857143
Name: Value, dtype: float64

In [36]:
## aggregate multiple functions 
grouped_agg=data.groupby('Sale_Region')['Value'].agg(['mean','sum','count'])
grouped_agg

                  mean     sum  count
Sale_Region
East         42.307692   550.0     13
North        37.666667   339.0      9
South        62.000000   496.0      8
West         61.588235  1047.0     17

In [37]:
# mering and joining dataframes
df1=pd.DataFrame({'Keys':['A','B','C'],'Value1':[1,2,3]})
df2=pd.DataFrame({'Keys':['A','B','D'],'Value1':[4,5,6]})
df1,df2

(  Keys  Value1
 0    A       1
 1    B       2
 2    C       3,
   Keys  Value1
 0    A       4
 1    B       5
 2    D       6)

In [38]:
# merging on the key ccolumns
# inner join
pd.merge(df1,df2, on='Keys',how='inner')

  Keys  Value1_x  Value1_y
0    A         1         4
1    B         2         5

In [39]:
# outer join 
pd.merge(df1,df2, on='Keys',how='outer')

  Keys  Value1_x  Value1_y
0    A       1.0       4.0
1    B       2.0       5.0
2    C       3.0       NaN
3    D       NaN       6.0

In [40]:
#left outer join 
pd.merge(df1,df2, on='Keys',how='left')

  Keys  Value1_x  Value1_y
0    A         1       4.0
1    B         2       5.0
2    C         3       NaN

In [41]:
# right outer join
pd.merge(df1,df2, on='Keys',how='right')

  Keys  Value1_x  Value1_y
0    A       1.0         4
1    B       2.0         5
2    D       NaN         6

In [42]:
# above examples on real examples - sales dataset
data=pd.read_csv('test_dir/sales1_data.csv')
data.head()

         Date   Product  Sales Region
0  2023-01-01  Product3  738.0   West
1  2023-01-02  Product2  868.0  North
2  2023-01-03  Product2  554.0   West
3  2023-01-04  Product1  618.0  South
4  2023-01-05  Product3  501.0   East

In [43]:
## check for null or na
data.isna().sum()

Date       0
Product    0
Sales      6
Region     0
dtype: int64

In [44]:
## fill the na values with mean
data['Sales'].fillna(data['Sales'].mean(),inplace=True)
data.isna().sum()

C:\Users\26amr\AppData\Local\Temp\ipykernel_5976\1997959055.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Sales'].fillna(data['Sales'].mean(),inplace=True)

Date       0
Product    0
Sales      0
Region     0
dtype: int64

In [45]:
data.dtypes

Date        object
Product     object
Sales      float64
Region      object
dtype: object

In [46]:
# group by operations on sales.data
data=pd.read_csv('test_dir/sales_data.csv')
data.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [47]:
# group by operations 
data.groupby(['Product Category'])[['Units Sold','Unit Price']].mean()

                  Units Sold  Unit Price
Product Category
Beauty Products        1.150     61.6230
Books                  2.850     16.1530
Clothing               3.625     67.5365
Electronics            1.650    691.5915
Home Appliances        1.475    320.1855
Sports                 2.200    261.2840

In [48]:
# group by
data.groupby(['Product Category'])['Total Revenue'].sum()

Product Category
Beauty Products     2621.90
Books               1861.93
Clothing            8128.93
Electronics        34982.41
Home Appliances    18646.16
Sports             14326.52
Name: Total Revenue, dtype: float64

In [49]:
# group by
data.groupby(['Product Category','Region'])['Total Revenue'].sum()

Product Category  Region
Beauty Products   Europe            2621.90
Books             North America     1861.93
Clothing          Asia              8128.93
Electronics       North America    34982.41
Home Appliances   Europe           18646.16
Sports            Asia             14326.52
Name: Total Revenue, dtype: float64

# Reading data from different Sources

In [50]:
import pandas as pd
from io import StringIO

Data = '{"employee_name": "Amruth", "email": "amruthpaiuni@gmail.com", "job_profile": [{"title": "Associate Consultant", "title2": "Production Support Engineer"}]}'
df=pd.read_json(StringIO(Data))
df

,employee_name,email,job_profile
0,Amruth,amruthpaiuni@gmail.com,"{'title': 'Associate Consultant', 'title2': 'P..."

In [51]:
df.to_json(orient='index')

'{"0":{"employee_name":"Amruth","email":"amruthpaiuni@gmail.com","job_profile":{"title":"Associate Consultant","title2":"Production Support Engineer"}}}'

In [52]:
df.to_json(orient='records')

'[{"employee_name":"Amruth","email":"amruthpaiuni@gmail.com","job_profile":{"title":"Associate Consultant","title2":"Production Support Engineer"}}]'

In [53]:
data=pd.read_csv('test_dir/wine.csv',header=None)
data.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,0.0,1,2.00,3.00,4.00,5.0,6,7.00,8.00,9.00,10.00,11.00,12.00,13.00,14
1,0.0,NaN,0,1.00,2.00,3.00,4.0,5,6.00,7.00,8.00,9.00,10.00,11.00,12.00,13
2,1.0,0.0,1,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065
3,2.0,1.0,1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050
4,3.0,2.0,1,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185

In [54]:
data.to_csv('test_dir/wine2.csv')

In [55]:
url='https://www.fdic.gov/bank-failures/failed-bank-list'
data=pd.read_html(url)
data[0].head()

,Bank Name,City,State,Cert,Aquiring Institution,Closing Date,Fund Sort ascending
0,The First National Bank of Lindsay,Lindsay,Oklahoma,4134,"First Bank & Trust Co., Duncan, OK","October 18, 2024",10547
1,Republic First Bank dba Republic Bank,Philadelphia,Pennsylvania,27332,"Fulton Bank, National Association","April 26, 2024",10546
2,Citizens Bank,Sac City,Iowa,8758,Iowa Trust & Savings Bank,"November 3, 2023",10545
3,Heartland Tri-State Bank,Elkhart,Kansas,25851,"Dream First Bank, N.A.","July 28, 2023",10544
4,First Republic Bank,San Francisco,California,59017,"JPMorgan Chase Bank, N.A.","May 1, 2023",10543

In [56]:
# read tables from url 
table=pd.read_html('https://en.wikipedia.org/wiki/Mobile_country_code',match='Mobile country code',header=0)
table[0].head()

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN

In [59]:
# readign excel files 
data=pd.read_excel('test_dir/sample_data.xlsx')
data.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
1,NaN,1,1,TEST,Test network,Operational,any,NaN
2,NaN,1,1,TEST,Test network,Operational,any,NaN
3,NaN,999,99,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[6]"
4,NaN,999,999,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[6]"

# pickle file 
- binary file that stores serialized python objects. 
- objects are converted to byte stream that can be stored on disk or transmitted over network 
- later the byte stream can be deserialized back into the original python objects

In [64]:
data.to_pickle('test_dir/df_pickle')

In [65]:
pd.read_pickle('test_dir/df_pickle')

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,NaN,MCC,MNC,Brand,Operator,Status,Bands (MHz),References and notes
1,NaN,1,1,TEST,Test network,Operational,any,NaN
2,NaN,1,1,TEST,Test network,Operational,any,NaN
3,NaN,999,99,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[6]"
4,NaN,999,999,NaN,Internal use,Operational,any,"Internal use in private networks, no roaming[6]"